In [122]:
import pandas as pd
import numpy as np

Series (It is a one-dimensional array holding data of any type.)

In [123]:
lables = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [124]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [125]:
pd.Series(data = my_data, index = lables)

a    10
b    20
c    30
dtype: int64

In [126]:
pd.Series(my_data,lables)

a    10
b    20
c    30
dtype: int64

In [127]:
pd.Series(arr,lables)

a    10
b    20
c    30
dtype: int32

In [128]:
ser1 = pd.Series(d)
ser1

a    10
b    20
c    30
dtype: int64

In [129]:
ser1['b']

20

In [130]:
set1 = pd.Series([1,2,3],['India', 'Japan','China'])
set1

India    1
Japan    2
China    3
dtype: int64

In [131]:
set2 = pd.Series([5,4,2],['India', 'USA','China'])
set2

India    5
USA      4
China    2
dtype: int64

In [132]:
set1+set2
#here the similar labels get added and the unique one will be defined with NaN

China    5.0
India    6.0
Japan    NaN
USA      NaN
dtype: float64

DATA FRAMES (DataFrame is a 2-dimensional labeled data structure with columns of potentially different types)

In [133]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
#                   random 5X4 matrix  , Row labels       ,   Column labels
df

          W         X         Y         Z
A -0.380104 -1.666059 -2.736995  1.522562
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358
E -1.306482 -1.632924  0.802129 -1.667537

In [134]:
df['W']
#df.W also works but might not be a good practice

A   -0.380104
B    0.178009
C    1.130018
D   -0.125381
E   -1.306482
Name: W, dtype: float64

In [135]:
df[['W','Z']]
# use double square brackets when you want two or more column

          W         Z
A -0.380104  1.522562
B  0.178009  1.743477
C  1.130018 -1.063049
D -0.125381 -1.046358
E -1.306482 -1.667537

In [136]:
df['new'] = df['W'] + df['Y']
df
#To create a new column

          W         X         Y         Z       new
A -0.380104 -1.666059 -2.736995  1.522562 -3.117098
B  0.178009 -0.626805 -0.391089  1.743477 -0.213080
C  1.130018  0.897796  0.330866 -1.063049  1.460884
D -0.125381 -0.945588  2.029544 -1.046358  1.904163
E -1.306482 -1.632924  0.802129 -1.667537 -0.504353

In [137]:
df.drop('new', axis=1)

          W         X         Y         Z
A -0.380104 -1.666059 -2.736995  1.522562
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358
E -1.306482 -1.632924  0.802129 -1.667537

In [138]:
df
#We could remove the row only in the previous cell but not completelty

          W         X         Y         Z       new
A -0.380104 -1.666059 -2.736995  1.522562 -3.117098
B  0.178009 -0.626805 -0.391089  1.743477 -0.213080
C  1.130018  0.897796  0.330866 -1.063049  1.460884
D -0.125381 -0.945588  2.029544 -1.046358  1.904163
E -1.306482 -1.632924  0.802129 -1.667537 -0.504353

In [139]:
df.drop('new', axis=1, inplace=True)
#hence we use inplace= true method in order to permanently drop the data that we want

In [140]:
df

          W         X         Y         Z
A -0.380104 -1.666059 -2.736995  1.522562
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358
E -1.306482 -1.632924  0.802129 -1.667537

In [141]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.380104 -1.666059 -2.736995  1.522562
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358

In [142]:
df.shape

(5, 4)

In [143]:
#extract rows
#loc = location
df.loc['A']

W   -0.380104
X   -1.666059
Y   -2.736995
Z    1.522562
Name: A, dtype: float64

In [144]:
# extract row way-2
#iloc = index location
df.iloc[0]

W   -0.380104
X   -1.666059
Y   -2.736995
Z    1.522562
Name: A, dtype: float64

In [145]:
#to extract one value
df.loc['D','Z']

-1.0463583859222323

In [146]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.380104 -2.736995
B  0.178009 -0.391089

In [147]:
booldf = df > 0
booldf

       W      X      Y      Z
A  False  False  False   True
B   True  False  False   True
C   True   True   True  False
D  False  False   True  False
E  False  False   True  False

In [148]:
df[booldf]
# or u can say df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  1.522562
B  0.178009       NaN       NaN  1.743477
C  1.130018  0.897796  0.330866       NaN
D       NaN       NaN  2.029544       NaN
E       NaN       NaN  0.802129       NaN

In [149]:
df['W']>0

A    False
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [150]:
df['W']

A   -0.380104
B    0.178009
C    1.130018
D   -0.125381
E   -1.306482
Name: W, dtype: float64

In [151]:
df[df['W']>0]
# we only get rows that satisfies the condition

          W         X         Y         Z
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049

In [152]:
#multiple conditions
df[(df['W']>0) & (df['Y']>1)]
#my random numbers doesn't ave any output for such condition, might work for u

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [153]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358

In [154]:
#reset index to default
df.reset_index()
# you can use inplace = True function to maker it peramanent
# our index turns into a column

  index         W         X         Y         Z
0     A -0.380104 -1.666059 -2.736995  1.522562
1     B  0.178009 -0.626805 -0.391089  1.743477
2     C  1.130018  0.897796  0.330866 -1.063049
3     D -0.125381 -0.945588  2.029544 -1.046358
4     E -1.306482 -1.632924  0.802129 -1.667537

In [155]:
newindex = 'CA NY WY OR CO'.split()
newindex
#quick may to make index

['CA', 'NY', 'WY', 'OR', 'CO']

In [156]:
df['States'] = newindex

In [157]:
df

          W         X         Y         Z States
A -0.380104 -1.666059 -2.736995  1.522562     CA
B  0.178009 -0.626805 -0.391089  1.743477     NY
C  1.130018  0.897796  0.330866 -1.063049     WY
D -0.125381 -0.945588  2.029544 -1.046358     OR
E -1.306482 -1.632924  0.802129 -1.667537     CO

In [158]:
df.set_index('States',inplace = True)
# Altering index according to our requirement

In [159]:
df

               W         X         Y         Z
States
CA     -0.380104 -1.666059 -2.736995  1.522562
NY      0.178009 -0.626805 -0.391089  1.743477
WY      1.130018  0.897796  0.330866 -1.063049
OR     -0.125381 -0.945588  2.029544 -1.046358
CO     -1.306482 -1.632924  0.802129 -1.667537

MULTI INDEXING

In [160]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [161]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [162]:
df = pd.DataFrame(np.random.randn(6,2), hier_index,['A','B'])
df

             A         B
G1 1  0.608857  0.286473
   2 -0.205792  2.493990
   3 -0.547260  0.496727
G2 1 -1.235614 -0.798428
   2  0.754121 -0.772041
   3 -0.034432  0.688408

In [174]:
df.loc['G1':'A']

Empty DataFrame
Columns: [A, B]
Index: []

In [169]:
df.loc['G1'].loc[1:2]

          A         B
1  0.608857  0.286473
2 -0.205792  2.493990

In [172]:
#naming
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.608857  0.286473
       2   -0.205792  2.493990
       3   -0.547260  0.496727
G2     1   -1.235614 -0.798428
       2    0.754121 -0.772041
       3   -0.034432  0.688408

In [173]:
df.loc['G2'].loc[2]['B']

-0.7720406439702567

In [177]:
df.xs(1, level='Num') #cross section to extract only value 1

               A         B
Groups
G1      0.608857  0.286473
G2     -1.235614 -0.798428

Done with Mid level pandas 🥳🥳🥳